Revit 2024 API
WallSweepInfo.DistanceMeasuredFrom Property
 Indicates if Distance is measured from the top or bottom of the wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public DistanceMeasuredFrom DistanceMeasuredFrom { get; set; }
Visual Basic
Public Property DistanceMeasuredFrom As DistanceMeasuredFrom
	Get
	Set
Visual C++
public:
property DistanceMeasuredFrom DistanceMeasuredFrom {
	DistanceMeasuredFrom get ();
	void set (DistanceMeasuredFrom value);
}
Field Value
 If the sweep or reveal is vertical, DistanceMeasuredFrom.Base represents the start of the wall's location curve (t=0). DistanceMeasuredFrom.Top is currently not implemented for vertical sweeps and shouldn't be used when creating them.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace